/*
------------------------------------------------------------
Copyright 2003-2012 Haute école ARC Ingéniérie, Switzerland. 
All rights reserved.
------------------------------------------------------------
File name :	mCpu.c
Author and date :	Monnerat Serge 15 févr. 2012

Description in the header file (.h)

-----------------------------------------------------------------------------
History:
-----------------------------------------------------------------------------

$History: $

-----------------------------------------------------------------------------
*/

#include "mCpu.h"
#include "iCpu.h"

//-----------------------------------------------------------------------
// Low level CPU setup
//-----------------------------------------------------------------------
void mCpu_Setup(void)
{
	// PLL and crossbar configuration
	iCpu_SysInit();
}

